# todo: Заданы три числа в переменных x, y, z.
# Напечатать наибольшее из этих чисел.
# Пример:
# x = 10
# y = 15
# z = 2
# Ответ:
# Наибольшее число 15


x=10
y=15
z=2
number=x
if y > number:
... number = y
... if z > number:
... number = z
... print ("наибольшее число", number)
...
наибольшее число 15


# Пример:
# x = 77
# y = 9
# z = 130
# Ответ:
# Наибольшее число 130
# Задачу решить без функций max и прочих.


x = 77
y = 9
z = 130
number = x
if y > number:
... number = y
... if z > number:
... number = z
... print('наибольшее число', number)
...
наибольшее число 130
